In [1]:
import pandas as pd

In [2]:
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv('data/MSFT.csv', index_col='Date')

In [4]:
data

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2015-01-02,46.660000,47.419998,46.540001,46.759998,40.620659,27913900
2015-01-05,46.369999,46.730000,46.250000,46.330002,40.247124,39673900
2015-01-06,46.380001,46.750000,45.540001,45.650002,39.656403,36447900
2015-01-07,45.980000,46.459999,45.490002,46.230000,40.160255,29114100
2015-01-08,46.750000,47.750000,46.720001,47.590000,41.341690,29645200
...,...,...,...,...,...,...
2023-07-10,334.600006,335.230011,327.589996,331.829987,331.829987,32791400
2023-07-11,331.059998,332.859985,327.000000,332.470001,332.470001,26698200
2023-07-12,336.600006,341.649994,335.670013,337.200012,337.200012,29995300
2023-07-13,339.559998,343.739990,339.019989,342.660004,342.660004,20567200
2023-07-14,347.589996,351.429993,344.309998,345.239990,345.239990,28302200

In [5]:
data['Open']

Date
2015-01-02     46.660000
2015-01-05     46.369999
2015-01-06     46.380001
2015-01-07     45.980000
2015-01-08     46.750000
                 ...
2023-07-10    334.600006
2023-07-11    331.059998
2023-07-12    336.600006
2023-07-13    339.559998
2023-07-14    347.589996
Name: Open, Length: 2147, dtype: float64

In [6]:
data1 = data['Open']

In [7]:
data1

Date
2015-01-02     46.660000
2015-01-05     46.369999
2015-01-06     46.380001
2015-01-07     45.980000
2015-01-08     46.750000
                 ...
2023-07-10    334.600006
2023-07-11    331.059998
2023-07-12    336.600006
2023-07-13    339.559998
2023-07-14    347.589996
Name: Open, Length: 2147, dtype: float64

In [8]:
typeof(data1)

NameError: name 'typeof' is not defined

In [9]:
type(data1)

pandas.core.series.Series

In [10]:
type(data)

pandas.core.frame.DataFrame

In [14]:
data_slow = data1.rolling(10).mean()

In [15]:
data_slow

Date
2015-01-02           NaN
2015-01-05           NaN
2015-01-06           NaN
2015-01-07           NaN
2015-01-08           NaN
                 ...
2023-07-10    335.819998
2023-07-11    335.553998
2023-07-12    336.028000
2023-07-13    336.517999
2023-07-14    337.806000
Name: Open, Length: 2147, dtype: float64

In [12]:
data_slow

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2015-01-02,NaN,NaN,NaN,NaN,NaN,NaN
2015-01-05,NaN,NaN,NaN,NaN,NaN,NaN
2015-01-06,NaN,NaN,NaN,NaN,NaN,NaN
2015-01-07,NaN,NaN,NaN,NaN,NaN,NaN
2015-01-08,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
2023-07-10,335.819998,339.163998,333.281000,336.106998,336.106998,22277400.0
2023-07-11,335.553998,338.838998,333.132001,336.493997,336.493997,22795160.0
2023-07-12,336.028000,339.388998,333.769003,336.756998,336.756998,23359280.0
2023-07-13,336.517999,339.964996,334.290002,337.437997,337.437997,23390050.0
2023-07-14,337.806000,341.496997,335.459003,338.456998,338.456998,24520570.0

In [13]:
data1

Date
2015-01-02     46.660000
2015-01-05     46.369999
2015-01-06     46.380001
2015-01-07     45.980000
2015-01-08     46.750000
                 ...
2023-07-10    334.600006
2023-07-11    331.059998
2023-07-12    336.600006
2023-07-13    339.559998
2023-07-14    347.589996
Name: Open, Length: 2147, dtype: float64

In [16]:
type(data1)

pandas.core.series.Series

In [18]:
new_data = pd.core.frame.DataFrame

In [19]:
new_data

pandas.core.frame.DataFrame

In [20]:
new_data['data'] = data1

TypeError: 'type' object does not support item assignment

In [21]:
new_data

pandas.core.frame.DataFrame

In [22]:
new_data['data'] = data1

TypeError: 'type' object does not support item assignment

In [30]:
new_data['data'] = data1

TypeError: 'type' object does not support item assignment